Revit 2027 API
ParameterTypeId.BendingDetailTypeBendDiameterDimensionsEnabled Property
 "Bend Diameter Dimensions"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeBendDiameterDimensionsEnabled { get; }
Public Shared ReadOnly Property BendingDetailTypeBendDiameterDimensionsEnabled As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeBendDiameterDimensionsEnabled {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeBendDiameterDimensionsEnabled : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace